app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@items = Item.find(params[:id].to_i)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "serial_number" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["serial_number", "456GGHFF"], ["updated_at", "2018-03-14 21:45:27.910899"], ["id", 1]]
---
	def update
		@items = Item.find(params[:id].to_i)
		if(@items.present?)
			@items.update(items_params)

INSERT INTO "items" ("serial_number", "description", "supplier", "status", "lender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@items = Item.new(items_params)
		if(@items.save)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 6]]
---
	def destroy
		@items = Item.find(params[:id].to_i)
		if(@items.present?)
			@items.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@items = Item.find(params[:id].to_i)